package com.graduation.mawruth.ui.museumDetails

import com.graduation.mawruth.R

object testData {
    val list = listOf(
        PieceData(
            R.drawable.tooot,
            "قناع توت عنخ آمون",
            "1390 قبل الميلاد",
            "قناع توت عنخ آمون هو قناع الموت للفرعون توت عنخ آمون من الأسرة الثامنة عشر في مصر القديمة (حكم بين أعوام 1332-1323 قبل الميلاد). وقد اكتشف من قبل هوارد كارتر في عام 1925 في مقبرة 62 وهو موجود الآن في المتحف المصري في القاهرة. القناع هو واحد من أكثر الأعمال الفنية شهرة في العالم.\n" +
                    "\n" +
                    "وفقا لعالم المصريات نيكولاس ريفز، القناع «ليس فقط الصورة المثالية لمقبرة توت عنخ أمون، بل ربما أكثر العناصر شهرة حول مصر القديمة نفسها». منذ عام 2001، أشارت البحوث إلى أنه ربما كان المقصود منه في الأصل الملكة نيفيرنفيرواتين; حيث أن اسمها الملكي (Ankhkheperure) وجد في خرطوش ممحي جزئيا داخل القناع."
        ),
        PieceData(
            R.drawable.rams,
            "تمثال رمسيس الثاني",
            "1340 قبل الميلاد",
            "تمثال رمسيس الثاني هو تمثال يبلغ عمره 3200 عام يمثل رمسيس الثاني. ويصور التمثال رمسيس الثاني واقفا. تم اكتشاف التمثال العام 1820 من خلال المستكشف «جيوفاني باتيستا كافيليا» في «معبد ميت رهينة العظيم» قرب ممفيس في مصر. وتعد منطقة ميت رهينة أو ممفيس التابعة لمركز ومدينة البدرشين بالجيزة هي الموطن الأصلى لتمثال رمسيس الثانى."
        ),
        PieceData(
            R.drawable.fana,
            "ابريق عثماني",
            "القرن 10هـ/16م",
            "كان الأمير طبطق من رجال السلطان شعبان الثاني 764-777 هـ/1363-1376م, وقد زُخرف الطست بكتابات بخط النسخ وتشتمل على اسم وألقاب الأمير وهى ”مما عمل برسم المقر الأشرف العالي المولوي العالمي العادلي الغازي المجاهدي المرابطي الملكي المخدومي السيفي طبطق الملكي الأشرفي\" كما يحمل رنك الكأس الذي يرمز إلي وظيفته كساقي للسطان، وقد عُثر على هذا الإبريق في حفائر بمدينة قوص في صعيد مصر.\n"
        ),
    )
}